In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import os,json

# Load Data

In [8]:
## Folder to save IMDB files
FOLDER = "Data/Movies Data/"
# os.makedirs(FOLDER,exist_ok=True)
sorted(os.listdir(FOLDER))

['Movies Datacombined_tmdb_api_data.csv.gz',
 'Movies Datatmdb_api_results_2000.json',
 'Movies Datatmdb_api_results_2001.json',
 'final_tmdb_data_2000.csv.gz',
 'final_tmdb_data_2001.csv.gz',
 'title_akas.csv.gz',
 'title_basics.csv.gz',
 'title_ratings.csv.gz']

# Extract: Loading Previous Data

### Title Basics

In [9]:
# Title basics

basics = pd.read_csv(f'{FOLDER}title_basics.csv.gz',low_memory=False)
basics.info()
basics.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 81768 entries, 0 to 81767
Data columns (total 8 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          81768 non-null  object
 1   titleType       81768 non-null  object
 2   primaryTitle    81768 non-null  object
 3   originalTitle   81768 non-null  object
 4   isAdult         81768 non-null  int64
 5   startYear       81768 non-null  float64
 6   runtimeMinutes  81768 non-null  int64
 7   genres          81768 non-null  object
dtypes: float64(1), int64(2), object(5)
memory usage: 5.0+ MB

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020.0,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,122,Drama
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,100,"Comedy,Horror,Sci-Fi"
4,tt0093119,movie,Grizzly II: Revenge,Grizzly II: The Predator,0,2020.0,74,"Horror,Music,Thriller"

### Title Ratings

In [10]:
# Title ratings
ratings = pd.read_csv(f"{FOLDER}/title_ratings.csv.gz",low_memory=False)
ratings.info()
ratings.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1252173 entries, 0 to 1252172
Data columns (total 3 columns):
 #   Column         Non-Null Count    Dtype
---  ------         --------------    -----
 0   tconst         1252173 non-null  object
 1   averageRating  1252173 non-null  float64
 2   numVotes       1252173 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 28.7+ MB

      tconst  averageRating  numVotes
0  tt0000001            5.7      1891
1  tt0000002            5.9       253
2  tt0000003            6.5      1684
3  tt0000004            5.7       166
4  tt0000005            6.2      2502

# Transform

Basics

- normalize and separate genre
- drop "original_title" (we will use the primary title column instead)
- drop  "isAdult" ("Adult" will show up in the genres so this is redundant information).
- drop  "titleType" (every row will be a movie).
- "genres" and other variants of genre (genre is now represented in the 2 new tables described above.

In [11]:
cols_to_drop = ['originalTitle','isAdult','titleType']
basics = basics.drop(columns=cols_to_drop)
basics

,tconst,primaryTitle,startYear,runtimeMinutes,genres
0,tt0035423,Kate & Leopold,2001.0,118,"Comedy,Fantasy,Romance"
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70,Drama
2,tt0069049,The Other Side of the Wind,2018.0,122,Drama
3,tt0088751,The Naked Monster,2005.0,100,"Comedy,Horror,Sci-Fi"
4,tt0093119,Grizzly II: Revenge,2020.0,74,"Horror,Music,Thriller"
...,...,...,...,...,...
81763,tt9914942,Life Without Sara Amat,2019.0,74,Drama
81764,tt9915872,The Last White Witch,2019.0,97,"Comedy,Drama,Fantasy"
81765,tt9916170,The Rehearsal,2019.0,51,Drama
81766,tt9916190,Safeguard,2020.0,90,"Action,Adventure,Thriller"
81767,tt9916362,Coven,2020.0,92,"Drama,History"

In [12]:
# Confirm columns have been dropped

basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 81768 entries, 0 to 81767
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          81768 non-null  object
 1   primaryTitle    81768 non-null  object
 2   startYear       81768 non-null  float64
 3   runtimeMinutes  81768 non-null  int64
 4   genres          81768 non-null  object
dtypes: float64(1), int64(1), object(3)
memory usage: 3.1+ MB

## Normalize Genre

In [13]:
# Separate genre into 2 columns with the single-string genres as a list of strings

basics['genres_split'] = basics['genres'].str.split(',')
basics

,tconst,primaryTitle,startYear,runtimeMinutes,genres,genres_split
0,tt0035423,Kate & Leopold,2001.0,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70,Drama,[Drama]
2,tt0069049,The Other Side of the Wind,2018.0,122,Drama,[Drama]
3,tt0088751,The Naked Monster,2005.0,100,"Comedy,Horror,Sci-Fi","[Comedy, Horror, Sci-Fi]"
4,tt0093119,Grizzly II: Revenge,2020.0,74,"Horror,Music,Thriller","[Horror, Music, Thriller]"
...,...,...,...,...,...,...
81763,tt9914942,Life Without Sara Amat,2019.0,74,Drama,[Drama]
81764,tt9915872,The Last White Witch,2019.0,97,"Comedy,Drama,Fantasy","[Comedy, Drama, Fantasy]"
81765,tt9916170,The Rehearsal,2019.0,51,Drama,[Drama]
81766,tt9916190,Safeguard,2020.0,90,"Action,Adventure,Thriller","[Action, Adventure, Thriller]"
81767,tt9916362,Coven,2020.0,92,"Drama,History","[Drama, History]"

In [14]:
# Explode the dataframe to make each genre into a separate row

exploded_genres = basics.explode('genres_split')
exploded_genres

,tconst,primaryTitle,startYear,runtimeMinutes,genres,genres_split
0,tt0035423,Kate & Leopold,2001.0,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,Kate & Leopold,2001.0,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,Kate & Leopold,2001.0,118,"Comedy,Fantasy,Romance",Romance
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70,Drama,Drama
2,tt0069049,The Other Side of the Wind,2018.0,122,Drama,Drama
...,...,...,...,...,...,...
81766,tt9916190,Safeguard,2020.0,90,"Action,Adventure,Thriller",Action
81766,tt9916190,Safeguard,2020.0,90,"Action,Adventure,Thriller",Adventure
81766,tt9916190,Safeguard,2020.0,90,"Action,Adventure,Thriller",Thriller
81767,tt9916362,Coven,2020.0,92,"Drama,History",Drama
81767,tt9916362,Coven,2020.0,92,"Drama,History",History

In [17]:
# Gather unique genres from the genres_split column

unique_genres = sorted(exploded_genres['genres_split'].unique())

In [18]:
# Save tconst and genres_split into new dataframe

basics_genres = exploded_genres[['tconst','genres_split']].copy()
basics_genres.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0062336        Drama
2  tt0069049        Drama

In [21]:
# Make a dictionary with list of unique genres as the key and the new iteger id as values

genre_ints = range(len(unique_genres))
genre_map = dict(zip(unique_genres, range(len(unique_genres))))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Short': 20,
 'Sport': 21,
 'Talk-Show': 22,
 'Thriller': 23,
 'War': 24,
 'Western': 25}

In [22]:
# Use .map or .replace with our genre_id_map dictionary

title_genres['Genre_ID'] = title_genres['genres_split'].replace(genre_id_map)

# Drop the original genre column

title_genres.drop(columns=['genres_split'],inplace=True)
title_genres

          tconst  Genre_ID
0      tt0035423         5
0      tt0035423         9
0      tt0035423        18
1      tt0062336         7
2      tt0069049         7
...          ...       ...
81766  tt9916190         0
81766  tt9916190         2
81766  tt9916190        23
81767  tt9916362         7
81767  tt9916362        11

[152716 rows x 2 columns]

In [23]:
# Manaully make dataframe with named cols from the .keyd and .values

genre_lookup = pd.DataFrame({'Genre_Name': genre_id_map.keys(),
                             'Genre_ID':genre_id_map.values()})
genre_lookup.head()

  Genre_Name  Genre_ID
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

In [24]:
## Dropping original genre columns 
basics = basics.drop(columns=['genres','genres_split'])
basics

,tconst,primaryTitle,startYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001.0,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70
2,tt0069049,The Other Side of the Wind,2018.0,122
3,tt0088751,The Naked Monster,2005.0,100
4,tt0093119,Grizzly II: Revenge,2020.0,74
...,...,...,...,...
81763,tt9914942,Life Without Sara Amat,2019.0,74
81764,tt9915872,The Last White Witch,2019.0,97
81765,tt9916170,The Rehearsal,2019.0,51
81766,tt9916190,Safeguard,2020.0,90
81767,tt9916362,Coven,2020.0,92

# MySQL

In [25]:
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists
from sqlalchemy.types import *

In [27]:
# Create connection string using credentials following this format

connection_str = "mysql+pymysql://root:root@localhost/imdb"

In [30]:
# Check if database exists, if not, create it

if database_exists(connection_str) == False:
    print("Creating the database.")
    create_database(connection_str)
else:
    print('The database already exists.')

Creating the database.

In [31]:
## create engine
engine = create_engine(connection_str)

## Saving tables

In [32]:
## saving text length
key_len = basics['tconst'].map(len).max()
title_len = basics['primaryTitle'].map(len).max()
key_len, title_len

(10, 242)

In [33]:
basics_schema = {
    "tconst": String(key_len+1), 
    "primaryTitle": Text(title_len+1),
    'startYear':Float(),
    'runtimeMinutes':Integer()
    }
basics_schema

{'tconst': String(length=11),
 'primaryTitle': Text(length=243),
 'startYear': Float(),
 'runtimeMinutes': Integer()}

In [34]:
basics

,tconst,primaryTitle,startYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001.0,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70
2,tt0069049,The Other Side of the Wind,2018.0,122
3,tt0088751,The Naked Monster,2005.0,100
4,tt0093119,Grizzly II: Revenge,2020.0,74
...,...,...,...,...
81763,tt9914942,Life Without Sara Amat,2019.0,74
81764,tt9915872,The Last White Witch,2019.0,97
81765,tt9916170,The Rehearsal,2019.0,51
81766,tt9916190,Safeguard,2020.0,90
81767,tt9916362,Coven,2020.0,92

In [35]:
# Saving basics as table with schema

basics.to_sql('title_basics',engine,dtype=basics_schema,if_exists='replace',index=False)

# Setting title basics as the primary key

engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')

In [36]:
# Query first 5 rows 

q = """
SELECT 
    * 
FROM 
    title_basics 
LIMIT 
    5"""
pd.read_sql(q,engine)

,tconst,primaryTitle,startYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001.0,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70
2,tt0069049,The Other Side of the Wind,2018.0,122
3,tt0088751,The Naked Monster,2005.0,100
4,tt0093119,Grizzly II: Revenge,2020.0,74

## Saving Genres Table

In [37]:
genre_lookup.head()

  Genre_Name  Genre_ID
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

In [38]:
## Primary key is Genre_ID
genre_lookup.to_sql('genres',engine,index=False, if_exists='replace')

engine.execute('ALTER TABLE genres ADD PRIMARY KEY (`Genre_ID`);')

In [39]:
q = """
SELECT 
    * 
FROM 
    genres 
LIMIT 
    5"""
pd.read_sql(q,engine)

  Genre_Name  Genre_ID
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

## Saving title_genres table

In [40]:
## NO PRIMARY KEY - DUPLCIATE VALUES
title_genres.to_sql('title_genres',engine,index=False,
                    if_exists='replace' )

# engine.execute('ALTER TABLE title_genres ADD PRIMARY KEY (`tconst`);')

In [41]:
q = """
SELECT 
    * 
FROM 
    title_genres 
LIMIT 
    5"""
pd.read_sql(q,engine)

      tconst  Genre_ID
0  tt0035423         5
1  tt0035423         9
2  tt0035423        18
3  tt0062336         7
4  tt0069049         7

## Saving title_ratings

In [42]:
ratings_schema = {'tconst':String(key_len+1), 
                 'averageRating':Float(),
                 'numVotes':Integer()}#get_schema(ratings)
ratings_schema

{'tconst': String(length=11), 'averageRating': Float(), 'numVotes': Integer()}

In [43]:
ratings.to_sql('title_ratings',engine,if_exists='replace',index=False,
              dtype=ratings_schema)
engine.execute("ALTER TABLE title_ratings ADD PRIMARY KEY (`tconst`)")

In [44]:
q = """
SELECT 
    * 
FROM 
    title_ratings 
LIMIT 
    5"""
pd.read_sql(q,engine)

      tconst  averageRating  numVotes
0  tt0000001            5.7      1891
1  tt0000002            5.9       253
2  tt0000003            6.5      1684
3  tt0000004            5.7       166
4  tt0000005            6.2      2502

## Saving TMDB API Data

In [49]:
df = pd.read_csv(f'{FOLDER}Movies Datacombined_tmdb_api_data.csv.gz',low_memory=False)
df.info()
df.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2824 entries, 0 to 2823
Data columns (total 26 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   adult                  2824 non-null   bool
 1   backdrop_path          1309 non-null   object
 2   belongs_to_collection  198 non-null    object
 3   budget                 2824 non-null   int64
 4   genres                 2824 non-null   object
 5   homepage               223 non-null    object
 6   id                     2824 non-null   int64
 7   imdb_id                2824 non-null   object
 8   original_language      2824 non-null   object
 9   original_title         2824 non-null   object
 10  overview               2764 non-null   object
 11  popularity             2824 non-null   float64
 12  poster_path            2398 non-null   object
 13  production_companies   2824 non-null   object
 14  production_countries   2824 non-null   object
 15  release_date           2785 non-null   object
 16  revenue                2824 non-null   int64
 17  runtime                2764 non-null   float64
 18  spoken_languages       2824 non-null   object
 19  status                 2824 non-null   object
 20  tagline                1087 non-null   object
 21  title                  2824 non-null   object
 22  video                  2824 non-null   bool
 23  vote_average           2824 non-null   float64
 24  vote_count             2824 non-null   int64
 25  certification          831 non-null    object
dtypes: bool(2), float64(3), int64(4), object(17)
memory usage: 535.1+ KB

,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,imdb_id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,False,/vMFs7nw6P0bIV1jDsQpxAieAVnH.jpg,NaN,10000000,"[{'id': 35, 'name': 'Comedy'}, {'id': 10402, '...",NaN,62127,tt0113026,en,The Fantasticks,...,0,86.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Try to remember the first time magic happened,The Fantasticks,False,5.4,21,NaN
1,False,NaN,NaN,0,"[{'id': 878, 'name': 'Science Fiction'}]",NaN,110977,tt0113092,en,For the Cause,...,0,100.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,The ultimate showdown on a forbidden planet.,For the Cause,False,4.4,7,NaN
2,False,NaN,NaN,0,"[{'id': 18, 'name': 'Drama'}, {'id': 28, 'name...",NaN,442869,tt0116391,hi,Gang,...,0,152.0,"[{'english_name': 'Hindi', 'iso_639_1': 'hi', ...",Released,NaN,Gang,False,0.0,0,NaN
3,False,/n4GJFGzsc7NinI1VeGDXIcQjtU2.jpg,NaN,150000,"[{'id': 18, 'name': 'Drama'}, {'id': 10749, 'n...",http://www.wkw-inthemoodforlove.com/,843,tt0118694,cn,花樣年華,...,12854953,99.0,"[{'english_name': 'Cantonese', 'iso_639_1': 'c...",Released,"Feel the heat, keep the feeling burning, let t...",In the Mood for Love,False,8.1,1879,PG
4,False,NaN,NaN,0,"[{'id': 18, 'name': 'Drama'}]",NaN,49511,tt0118852,en,Chinese Coffee,...,0,99.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,There's a fine line between friendship and bet...,Chinese Coffee,False,6.9,46,R

In [50]:
## Keeping some columns
cols_to_keep = ['imdb_id','budget','revenue','certification',
                'original_language']
com_api_data = df[cols_to_keep]
com_api_data

        imdb_id    budget   revenue certification original_language
0     tt0113026  10000000         0           NaN                en
1     tt0113092         0         0           NaN                en
2     tt0116391         0         0           NaN                hi
3     tt0118694    150000  12854953            PG                cn
4     tt0118852         0         0             R                en
...         ...       ...       ...           ...               ...
2819  tt8005686         0         0           NaN                en
2820  tt8665056         0         0           NaN                en
2821  tt8795764         0         0            NR                en
2822  tt9071078         0         0           NaN                cn
2823  tt9668554         0         0           NaN                en

[2824 rows x 5 columns]

In [51]:
# Missing data within our API df

com_api_data.isna().sum()

imdb_id                 0
budget                  0
revenue                 0
certification        1993
original_language       0
dtype: int64

In [60]:
# Saving text length

key_length = com_api_data['imdb_id'].map(len).max()
cert_length = com_api_data['certification'].fillna('').map(len).max()
lang_length = com_api_data['original_language'].map(len).max()

key_length, cert_length,lang_length

(10, 7, 2)

In [54]:
api_data_schema = {'imdb_id':String(key_len+1), 
                 'budget':Float(),
                   'revenue':Float(),
                 'certification':Text(cert_len+1),
                  'original_language':Text(lang_len+1)}
api_data_schema

{'imdb_id': String(length=11),
 'budget': Float(),
 'revenue': Float(),
 'certification': Text(length=8),
 'original_language': Text(length=3)}

In [55]:
com_api_data.to_sql('tmdb_data',engine, index=False,dtype=api_data_schema, if_exists='replace')

engine.execute('ALTER TABLE tmdb_data ADD PRIMARY KEY (`imdb_id`);')

In [58]:
q = """
SELECT 
    * 
FROM 
    tmdb_data 
LIMIT 
    5"""
pd.read_sql(q,engine)

     imdb_id      budget     revenue certification original_language
0  tt0035423  48000000.0  76019000.0         PG-13                en
1  tt0113026  10000000.0         0.0          None                en
2  tt0113092         0.0         0.0          None                en
3  tt0114447         0.0         0.0          None                en
4  tt0116391         0.0         0.0          None                hi

# Final Table Display

In [59]:
q = """SHOW TABLES;"""
pd.read_sql(q, engine)

  Tables_in_imdb
0         genres
1   title_basics
2   title_genres
3  title_ratings
4      tmdb_data